In [2]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [3]:
s= pd.Series([1,3,5,np.nan,6,9])

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [6]:
df

                   A         B         C         D
2013-01-01  1.203804 -0.328302  0.458339  1.103156
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931
2013-01-04 -2.764180  0.004221  0.738141  0.655959
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-06  0.306295  0.408263 -0.238683  0.405082

In [7]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [8]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [10]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-06  0.306295  0.408263 -0.238683  0.405082

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.to_numpy()

array([[ 1.20380415, -0.32830162,  0.45833926,  1.10315556],
       [ 0.33894874, -0.87157657, -3.16269753, -1.02660588],
       [ 2.01067912, -0.79636346,  0.94864989,  0.74493078],
       [-2.7641796 ,  0.00422089,  0.73814051,  0.6559594 ],
       [ 1.07386154, -0.76952448, -1.81245177, -0.52202879],
       [ 0.30629509,  0.40826332, -0.23868255,  0.40508182]])

In [13]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.203804    0.338949    2.010679   -2.764180    1.073862    0.306295
B   -0.328302   -0.871577   -0.796363    0.004221   -0.769524    0.408263
C    0.458339   -3.162698    0.948650    0.738141   -1.812452   -0.238683
D    1.103156   -1.026606    0.744931    0.655959   -0.522029    0.405082

In [15]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-01  1.203804 -0.328302  0.458339  1.103156
2013-01-04 -2.764180  0.004221  0.738141  0.655959
2013-01-06  0.306295  0.408263 -0.238683  0.405082

In [16]:
df["A"]

2013-01-01    1.203804
2013-01-02    0.338949
2013-01-03    2.010679
2013-01-04   -2.764180
2013-01-05    1.073862
2013-01-06    0.306295
Freq: D, Name: A, dtype: float64

In [19]:
df[0:1]

                   A         B         C         D
2013-01-01  1.203804 -0.328302  0.458339  1.103156

In [20]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  1.203804 -0.328302
2013-01-02  0.338949 -0.871577
2013-01-03  2.010679 -0.796363
2013-01-04 -2.764180  0.004221
2013-01-05  1.073862 -0.769524
2013-01-06  0.306295  0.408263

In [23]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [25]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01  1.203804 -0.328302  0.458339  1.103156
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931
2013-01-04 -2.764180  0.004221  0.738141  0.655959
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-06  0.306295  0.408263 -0.238683  0.405082

Selection by Location of Label

In [27]:
df.loc[dates[0],"A"]

np.float64(1.2038041487835687)

In [29]:
df.at[dates[0],"A"]

np.float64(1.2038041487835687)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [30]:
df.iloc[3]

A   -2.764180
B    0.004221
C    0.738141
D    0.655959
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -2.764180  0.004221
2013-01-05  1.073862 -0.769524

In [32]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.338949 -3.162698
2013-01-03  2.010679  0.948650
2013-01-05  1.073862 -1.812452

In [34]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.328302  0.458339
2013-01-02 -0.871577 -3.162698
2013-01-03 -0.796363  0.948650
2013-01-04  0.004221  0.738141
2013-01-05 -0.769524 -1.812452
2013-01-06  0.408263 -0.238683

In [36]:
df.iloc[1,1]

np.float64(-0.8715765669446583)

In [38]:
df

                   A         B         C         D
2013-01-01  1.203804 -0.328302  0.458339  1.103156
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931
2013-01-04 -2.764180  0.004221  0.738141  0.655959
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-06  0.306295  0.408263 -0.238683  0.405082

Boolean Indexing

In [37]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  1.203804 -0.328302  0.458339  1.103156
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606
2013-01-03  2.010679 -0.796363  0.948650  0.744931
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029
2013-01-06  0.306295  0.408263 -0.238683  0.405082

In [39]:
df[df>0]

                   A         B         C         D
2013-01-01  1.203804       NaN  0.458339  1.103156
2013-01-02  0.338949       NaN       NaN       NaN
2013-01-03  2.010679       NaN  0.948650  0.744931
2013-01-04       NaN  0.004221  0.738141  0.655959
2013-01-05  1.073862       NaN       NaN       NaN
2013-01-06  0.306295  0.408263       NaN  0.405082

In [40]:
df2 = df.copy()

In [45]:
df2["E"] = ["one","one","two","three","four","three"]

In [46]:
df2

                   A         B         C         D      E
2013-01-01  1.203804 -0.328302  0.458339  1.103156    one
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606    one
2013-01-03  2.010679 -0.796363  0.948650  0.744931    two
2013-01-04 -2.764180  0.004221  0.738141  0.655959  three
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029   four
2013-01-06  0.306295  0.408263 -0.238683  0.405082  three

Setting

In [47]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [48]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [49]:
df["F"]=s1

In [50]:
df.at[dates[0],"A"]=0

In [51]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [52]:
df

                   A         B         C         D      E    F
2013-01-01  0.000000  0.000000  0.458339  1.103156    one  NaN
2013-01-02  0.338949 -0.871577 -3.162698 -1.026606    one  1.0
2013-01-03  2.010679 -0.796363  0.948650  0.744931    two  2.0
2013-01-04 -2.764180  0.004221  0.738141  0.655959  three  3.0
2013-01-05  1.073862 -0.769524 -1.812452 -0.522029   four  4.0
2013-01-06  0.306295  0.408263 -0.238683  0.405082  three  5.0

In [53]:
df.loc[:,"D"]=np.array([5]*len(df))

In [54]:
len(df)

6

In [55]:
df

                   A         B         C    D      E    F
2013-01-01  0.000000  0.000000  0.458339  5.0    one  NaN
2013-01-02  0.338949 -0.871577 -3.162698  5.0    one  1.0
2013-01-03  2.010679 -0.796363  0.948650  5.0    two  2.0
2013-01-04 -2.764180  0.004221  0.738141  5.0  three  3.0
2013-01-05  1.073862 -0.769524 -1.812452  5.0   four  4.0
2013-01-06  0.306295  0.408263 -0.238683  5.0  three  5.0

In [56]:
df2 = df.copy()

In [58]:
df2[df2>0]= -df2
df2

TypeError: bad operand type for unary -: 'str'